---
kind: method
id: M:Autodesk.Revit.DB.ElementRecord.GetBoundingBox
source: html/d8b87d2a-46ab-9f7c-c423-04517514f27e.htm
---
# Autodesk.Revit.DB.ElementRecord.GetBoundingBox Method

Gets the bounding box of the element record.

## Syntax (C#)
```csharp
public Outline GetBoundingBox()
```

## Returns
The bounding box outline. Nothing nullptr a null reference ( Nothing in Visual Basic) if there is no bounding box for this element.